## Deploy of tempdev.shared

Note import of aws_cloudwatch_log_group.chatbot

```
...
Creating shared.tf.json
terraform validate
Success! The configuration is valid.

python /Users/daniel/repo/azul3/scripts/rename_resources.py
2025-02-21 09:27:53,736    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
2025-02-21 09:27:55,461    INFO MainThread __main__: Found 'aws_securityhub_standards_control.nist_control_macie_1', already renamed
2025-02-21 09:27:55,461    INFO MainThread __main__: Found 'aws_securityhub_standards_control.nist_control_macie_2', already renamed
python /Users/daniel/repo/azul3/scripts/import_default_vpc.py
2025-02-21 09:27:55,621    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
2025-02-21 09:27:57,188    INFO MainThread __main__: The default VPC has already been imported.
2025-02-21 09:27:57,188    INFO MainThread __main__: The default VPC's default security group has already been imported.
python /Users/daniel/repo/azul3/scripts/import_cloudwatch_log_groups.py
2025-02-21 09:27:57,373    INFO MainThread botocore.credentials: Found credentials in environment variables.
2025-02-21 09:27:57,932    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
2025-02-21 09:27:59,598    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.chatbot'.
2025-02-21 09:27:59,598    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.chatbot', '/aws/chatbot/azul-chatbot-tempdev']
terraform apply
aws_iam_role.chatbot: Refreshing state... [id=azul-chatbot-tempdev]

...

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.chatbot will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "chatbot" {
        id                = "/aws/chatbot/azul-chatbot-tempdev"
        name              = "/aws/chatbot/azul-chatbot-tempdev"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"                = "azul-chatbot"
          + "billing"             = "anvil"
          + "component"           = "azul-chatbot"
          + "deployment"          = "tempdev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "shared"
        }
      ~ tags_all          = {
          + "Name"                = "azul-chatbot"
          + "billing"             = "anvil"
          + "component"           = "azul-chatbot"
          + "deployment"          = "tempdev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "shared"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_s3_bucket_lifecycle_configuration.aws_config will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "aws_config" {
      + bucket                                 = "edu-ucsc-gi-platform-temp-dev-awsconfig.us-east-1"
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = (known after apply)

      + rule {
          + id     = "expire"
          + status = "Enabled"

          + expiration {
              + days                         = 365
              + expired_object_delete_marker = (known after apply)
            }

          + filter {
            }
        }
    }

  # null_resource.image_2uFW_Y3KhG1_fxcxU05r03sqN2E must be replaced
-/+ resource "null_resource" "image_2uFW_Y3KhG1_fxcxU05r03sqN2E" {
      ~ id       = "6334824724549167320" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always" = "2025-02-21T17:02:30Z" -> (known after apply)
        }
    }

...

  # null_resource.repository_zWG8IIspasm7Xd9EUMjU6ACUZec must be replaced
-/+ resource "null_resource" "repository_zWG8IIspasm7Xd9EUMjU6ACUZec" {
      ~ id       = "1874068156324778273" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always" = "2025-02-21T17:03:30Z" -> (known after apply)
        }
    }

Plan: 24 to add, 1 to change, 23 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

...
Apply complete! Resources: 24 added, 1 changed, 23 destroyed.
```

## Redeploy of tempdev.shared

Note skipped import of aws_cloudwatch_log_group.chatbot

```
...
Creating shared.tf.json
terraform validate
Success! The configuration is valid.

python /Users/daniel/repo/azul3/scripts/rename_resources.py
2025-02-21 09:31:46,878    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
2025-02-21 09:31:48,498    INFO MainThread __main__: Found 'aws_securityhub_standards_control.nist_control_macie_1', already renamed
2025-02-21 09:31:48,498    INFO MainThread __main__: Found 'aws_securityhub_standards_control.nist_control_macie_2', already renamed
python /Users/daniel/repo/azul3/scripts/import_default_vpc.py
2025-02-21 09:31:48,678    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
2025-02-21 09:31:50,285    INFO MainThread __main__: The default VPC has already been imported.
2025-02-21 09:31:50,285    INFO MainThread __main__: The default VPC's default security group has already been imported.
python /Users/daniel/repo/azul3/scripts/import_cloudwatch_log_groups.py
2025-02-21 09:31:50,475    INFO MainThread botocore.credentials: Found credentials in environment variables.
2025-02-21 09:31:50,919    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
2025-02-21 09:31:52,557    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.chatbot'.
terraform apply
data.google_client_config.current: Reading...

...

Terraform will perform the following actions:

  # null_resource.image_2uFW_Y3KhG1_fxcxU05r03sqN2E must be replaced
-/+ resource "null_resource" "image_2uFW_Y3KhG1_fxcxU05r03sqN2E" {
      ~ id       = "6334824724549167320" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always" = "2025-02-21T17:29:25Z" -> (known after apply)
        }
    }

...

  # null_resource.repository_zWG8IIspasm7Xd9EUMjU6ACUZec must be replaced
-/+ resource "null_resource" "repository_zWG8IIspasm7Xd9EUMjU6ACUZec" {
      ~ id       = "2610529275472644968" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always" = "2025-02-21T17:30:22Z" -> (known after apply)
        }
    }

Plan: 23 to add, 0 to change, 23 to destroy.

...

Apply complete! Resources: 23 added, 0 changed, 23 destroyed.
```

## Deploy of tempdev

Note rename and import of aws_cloudwatch_log_group resources

```
...
Creating step_function.tf.json
terraform validate
Success! The configuration is valid.

python /Users/daniel/repo/azul3/scripts/rename_resources.py
2025-02-21 09:37:16,969    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
2025-02-21 09:37:18,688    INFO MainThread __main__: Found 'aws_cloudwatch_log_group.indexer', renaming it to 'aws_cloudwatch_log_group.indexer_api_gateway'
2025-02-21 09:37:18,689    INFO MainThread azul.terraform: Running ['terraform', 'state', 'mv', 'aws_cloudwatch_log_group.indexer', 'aws_cloudwatch_log_group.indexer_api_gateway']
2025-02-21 09:37:23,668    INFO MainThread __main__: Found 'aws_cloudwatch_log_group.service', renaming it to 'aws_cloudwatch_log_group.service_api_gateway'
2025-02-21 09:37:23,669    INFO MainThread azul.terraform: Running ['terraform', 'state', 'mv', 'aws_cloudwatch_log_group.service', 'aws_cloudwatch_log_group.service_api_gateway']
python /Users/daniel/repo/azul3/scripts/import_cloudwatch_log_groups.py
2025-02-21 09:37:27,306    INFO MainThread botocore.credentials: Found credentials in environment variables.
2025-02-21 09:37:28,185    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
2025-02-21 09:37:29,952    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.indexer_lambda'.
2025-02-21 09:37:29,953    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.indexer_lambda', '/aws/lambda/azul-indexer-tempdev']
2025-02-21 09:37:37,791    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.indexer_forward_alb_logs_lambda'.
2025-02-21 09:37:37,791    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.indexer_forward_alb_logs_lambda', '/aws/lambda/azul-indexer-tempdev-forward_alb_logs']
2025-02-21 09:37:45,324    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.indexer_forward_s3_logs_lambda'.
2025-02-21 09:37:45,325    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.indexer_forward_s3_logs_lambda', '/aws/lambda/azul-indexer-tempdev-forward_s3_logs']
2025-02-21 09:37:52,092    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.indexer_indexercachehealth_lambda'.
2025-02-21 09:37:52,092    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.indexer_indexercachehealth_lambda', '/aws/lambda/azul-indexer-tempdev-indexercachehealth']
2025-02-21 09:37:58,922    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.service_lambda'.
2025-02-21 09:37:58,923    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.service_lambda', '/aws/lambda/azul-service-tempdev']
2025-02-21 09:38:05,791    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.service_servicecachehealth_lambda'.
2025-02-21 09:38:05,791    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.service_servicecachehealth_lambda', '/aws/lambda/azul-service-tempdev-servicecachehealth']
2025-02-21 09:38:12,597    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.indexer_api_execution'.
2025-02-21 09:38:12,598    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.indexer_api_execution', 'API-Gateway-Execution-Logs_d9xt10gjh8/tempdev']
2025-02-21 09:38:20,106    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.service_api_execution'.
2025-02-21 09:38:20,106    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.service_api_execution', 'API-Gateway-Execution-Logs_en4r0jtgri/tempdev']
terraform apply
null_resource.hmac_secret: Refreshing state... [id=5577006791947779410]

...

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.indexer_aggregate_lambda will be created
  + resource "aws_cloudwatch_log_group" "indexer_aggregate_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/azul-indexer-tempdev-aggregate"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "Name"       = "azul-indexer_aggregate_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_aggregate_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all          = {
          + "Name"       = "azul-indexer_aggregate_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_aggregate_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
    }

  # aws_cloudwatch_log_group.indexer_aggregate_retry_lambda will be created
  + resource "aws_cloudwatch_log_group" "indexer_aggregate_retry_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/azul-indexer-tempdev-aggregate_retry"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "Name"       = "azul-indexer_aggregate_retry_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_aggregate_retry_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all          = {
          + "Name"       = "azul-indexer_aggregate_retry_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_aggregate_retry_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
    }

  # aws_cloudwatch_log_group.indexer_api_execution will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "indexer_api_execution" {
        id                = "API-Gateway-Execution-Logs_d9xt10gjh8/tempdev"
        name              = "API-Gateway-Execution-Logs_d9xt10gjh8/tempdev"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-indexer_api_execution-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_api_execution"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-indexer_api_execution-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_api_execution"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.indexer_api_gateway will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "indexer_api_gateway" {
        id                = "/aws/apigateway/azul-indexer-tempdev"
        name              = "/aws/apigateway/azul-indexer-tempdev"
      ~ tags              = {
          ~ "Name"       = "azul-indexer-tempdev" -> "azul-indexer_api_gateway-tempdev"
            "billing"    = "anvil"
          ~ "component"  = "azul-indexer" -> "azul-indexer_api_gateway"
            "deployment" = "tempdev"
            "owner"      = "hannes@ucsc.edu"
            "service"    = "azul"
        }
      ~ tags_all          = {
          ~ "Name"       = "azul-indexer-tempdev" -> "azul-indexer_api_gateway-tempdev"
          ~ "component"  = "azul-indexer" -> "azul-indexer_api_gateway"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.indexer_contribute_lambda will be created
  + resource "aws_cloudwatch_log_group" "indexer_contribute_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/azul-indexer-tempdev-contribute"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "Name"       = "azul-indexer_contribute_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_contribute_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all          = {
          + "Name"       = "azul-indexer_contribute_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_contribute_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
    }

  # aws_cloudwatch_log_group.indexer_contribute_retry_lambda will be created
  + resource "aws_cloudwatch_log_group" "indexer_contribute_retry_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/azul-indexer-tempdev-contribute_retry"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "Name"       = "azul-indexer_contribute_retry_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_contribute_retry_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all          = {
          + "Name"       = "azul-indexer_contribute_retry_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_contribute_retry_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
    }

  # aws_cloudwatch_log_group.indexer_forward_alb_logs_lambda will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "indexer_forward_alb_logs_lambda" {
        id                = "/aws/lambda/azul-indexer-tempdev-forward_alb_logs"
        name              = "/aws/lambda/azul-indexer-tempdev-forward_alb_logs"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-indexer_forward_alb_logs_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_forward_alb_logs_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-indexer_forward_alb_logs_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_forward_alb_logs_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.indexer_forward_s3_logs_lambda will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "indexer_forward_s3_logs_lambda" {
        id                = "/aws/lambda/azul-indexer-tempdev-forward_s3_logs"
        name              = "/aws/lambda/azul-indexer-tempdev-forward_s3_logs"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-indexer_forward_s3_logs_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_forward_s3_logs_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-indexer_forward_s3_logs_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_forward_s3_logs_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.indexer_indexercachehealth_lambda will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "indexer_indexercachehealth_lambda" {
        id                = "/aws/lambda/azul-indexer-tempdev-indexercachehealth"
        name              = "/aws/lambda/azul-indexer-tempdev-indexercachehealth"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-indexer_indexercachehealth_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_indexercachehealth_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-indexer_indexercachehealth_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_indexercachehealth_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.indexer_lambda will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "indexer_lambda" {
        id                = "/aws/lambda/azul-indexer-tempdev"
        name              = "/aws/lambda/azul-indexer-tempdev"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-indexer_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-indexer_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.service_api_execution will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "service_api_execution" {
        id                = "API-Gateway-Execution-Logs_en4r0jtgri/tempdev"
        name              = "API-Gateway-Execution-Logs_en4r0jtgri/tempdev"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-service_api_execution-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-service_api_execution"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-service_api_execution-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-service_api_execution"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.service_api_gateway will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "service_api_gateway" {
        id                = "/aws/apigateway/azul-service-tempdev"
        name              = "/aws/apigateway/azul-service-tempdev"
      ~ tags              = {
          ~ "Name"       = "azul-service-tempdev" -> "azul-service_api_gateway-tempdev"
            "billing"    = "anvil"
          ~ "component"  = "azul-service" -> "azul-service_api_gateway"
            "deployment" = "tempdev"
            "owner"      = "hannes@ucsc.edu"
            "service"    = "azul"
        }
      ~ tags_all          = {
          ~ "Name"       = "azul-service-tempdev" -> "azul-service_api_gateway-tempdev"
          ~ "component"  = "azul-service" -> "azul-service_api_gateway"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.service_lambda will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "service_lambda" {
        id                = "/aws/lambda/azul-service-tempdev"
        name              = "/aws/lambda/azul-service-tempdev"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-service_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-service_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-service_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-service_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.service_manifest_lambda will be created
  + resource "aws_cloudwatch_log_group" "service_manifest_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/azul-service-tempdev-manifest"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "Name"       = "azul-service_manifest_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-service_manifest_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all          = {
          + "Name"       = "azul-service_manifest_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-service_manifest_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
    }

  # aws_cloudwatch_log_group.service_servicecachehealth_lambda will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "service_servicecachehealth_lambda" {
        id                = "/aws/lambda/azul-service-tempdev-servicecachehealth"
        name              = "/aws/lambda/azul-service-tempdev-servicecachehealth"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-service_servicecachehealth_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-service_servicecachehealth_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-service_servicecachehealth_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-service_servicecachehealth_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_lambda_function.indexer will be updated in-place
  ~ resource "aws_lambda_function" "indexer" {
        id                             = "azul-indexer-tempdev"
        tags                           = {
            "Name"        = "azul-indexer-tempdev"
            "aws-chalice" = "version=1.31.3:stage=tempdev:app=azul-indexer"
            "billing"     = "anvil"
            "component"   = "azul-indexer"
            "deployment"  = "tempdev"
            "owner"       = "hannes@ucsc.edu"
            "service"     = "azul"
        }
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "azul_git_commit"                          = "3f8d8d9fb3441bbbfb05fa766ec8d97e82b8b59c" -> "4dddcfa6c2b5e42d584ede4f7650a022dbdcd3b1"
                # (43 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

...

  # aws_lambda_function.service_servicecachehealth will be updated in-place
  ~ resource "aws_lambda_function" "service_servicecachehealth" {
        id                             = "azul-service-tempdev-servicecachehealth"
        tags                           = {
            "Name"        = "azul-service_servicecachehealth-tempdev"
            "aws-chalice" = "version=1.31.3:stage=tempdev:app=azul-service"
            "billing"     = "anvil"
            "component"   = "azul-service_servicecachehealth"
            "deployment"  = "tempdev"
            "owner"       = "hannes@ucsc.edu"
            "service"     = "azul"
        }
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "azul_git_commit"                          = "3f8d8d9fb3441bbbfb05fa766ec8d97e82b8b59c" -> "4dddcfa6c2b5e42d584ede4f7650a022dbdcd3b1"
                # (43 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 5 to add, 21 to change, 0 to destroy.

...

Apply complete! Resources: 5 added, 21 changed, 0 destroyed.
```


## Redeploy of tempdev

Note no rename nor import of aws_cloudwatch_log_group resources

```
...
Creating step_function.tf.json
terraform validate
Success! The configuration is valid.

python /Users/daniel/repo/azul3/scripts/rename_resources.py
2025-02-21 09:41:28,931    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
2025-02-21 09:41:30,627    INFO MainThread __main__: Found 'aws_cloudwatch_log_group.indexer_api_gateway', already renamed
2025-02-21 09:41:30,627    INFO MainThread __main__: Found 'aws_cloudwatch_log_group.service_api_gateway', already renamed
python /Users/daniel/repo/azul3/scripts/import_cloudwatch_log_groups.py
2025-02-21 09:41:30,836    INFO MainThread botocore.credentials: Found credentials in environment variables.
2025-02-21 09:41:31,669    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
2025-02-21 09:41:33,783    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_lambda'.
2025-02-21 09:41:33,784    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_aggregate_lambda'.
2025-02-21 09:41:33,784    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_aggregate_retry_lambda'.
2025-02-21 09:41:33,784    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_contribute_lambda'.
2025-02-21 09:41:33,784    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_contribute_retry_lambda'.
2025-02-21 09:41:33,784    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_forward_alb_logs_lambda'.
2025-02-21 09:41:33,784    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_forward_s3_logs_lambda'.
2025-02-21 09:41:33,784    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_indexercachehealth_lambda'.
2025-02-21 09:41:33,784    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.service_lambda'.
2025-02-21 09:41:33,784    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.service_manifest_lambda'.
2025-02-21 09:41:33,784    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.service_servicecachehealth_lambda'.
2025-02-21 09:41:33,784    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_api_execution'.
2025-02-21 09:41:33,784    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.service_api_execution'.
terraform apply
data.google_client_config.current: Reading...

...

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
```
